; domain
(define (domain sokoban-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types
    location direction thing - object
    person stone - thing
 )
 (:predicates (movedir ?l_from - location ?l_to - location ?d - direction) (isnongoal ?l - location) (isgoal ?l - location) (clear ?l - location) (at_ ?t - thing ?l - location) (atgoal ?t - thing))
 (:functions (total-cost))
 (:action move
  :parameters ( ?p - person ?l_from - location ?l_to - location ?d - direction)
  :precondition (and (at_ ?p ?l_from) (clear ?l_to) (movedir ?l_from ?l_to ?d))
  :effect (and (not (at_ ?p ?l_from)) (not (clear ?l_to)) (at_ ?p ?l_to) (clear ?l_from) (increase (total-cost) 1)))
 (:action pushtogoal
  :parameters ( ?p - person ?s - stone ?l_p - location ?l_from - location ?l_to - location ?d - direction)
  :precondition (and (at_ ?p ?l_p) (at_ ?s ?l_from) (clear ?l_to) (movedir ?l_p ?l_from ?d) (movedir ?l_from ?l_to ?d) (isgoal ?l_to))
  :effect (and (not (at_ ?p ?l_p)) (not (at_ ?s ?l_from)) (not (clear ?l_to)) (at_ ?p ?l_from) (at_ ?s ?l_to) (clear ?l_p) (atgoal ?s) (increase (total-cost) 1)))
 (:action pushtonongoal
  :parameters ( ?p - person ?s - stone ?l_p - location ?l_from - location ?l_to - location ?d - direction)
  :precondition (and (at_ ?p ?l_p) (at_ ?s ?l_from) (clear ?l_to) (movedir ?l_p ?l_from ?d) (movedir ?l_from ?l_to ?d) (isnongoal ?l_to))
  :effect (and (not (at_ ?p ?l_p)) (not (at_ ?s ?l_from)) (not (clear ?l_to)) (at_ ?p ?l_from) (at_ ?s ?l_to) (clear ?l_p) (not (atgoal ?s)) (increase (total-cost) 1)))
)

; problem
(define (problem sokoban-problem)
 (:domain sokoban-domain)
 (:objects
   pos11 pos12 pos13 pos14 pos15 pos21 pos22 pos23 pos24 pos25 pos31 pos32 pos33 pos34 pos35 pos41 pos42 pos43 pos44 pos45 pos51 pos52 pos53 pos54 pos55 - location
   dirdown dirleft dirright dirup - direction
   player1 - person
   stone1 - stone
 )
 (:init (at_ player1 pos14) (at_ stone1 pos44) (clear pos11) (clear pos12) (clear pos13) (clear pos15) (clear pos21) (clear pos22) (clear pos23) (clear pos24) (clear pos25) (clear pos31) (clear pos32) (clear pos33) (clear pos34) (clear pos35) (clear pos41) (clear pos42) (clear pos43) (clear pos45) (clear pos51) (clear pos52) (clear pos53) (clear pos54) (clear pos55) (isgoal pos31) (movedir pos11 pos21 dirright) (movedir pos11 pos12 dirdown) (movedir pos12 pos22 dirright) (movedir pos12 pos11 dirup) (movedir pos12 pos13 dirdown) (movedir pos13 pos23 dirright) (movedir pos13 pos12 dirup) (movedir pos13 pos14 dirdown) (movedir pos14 pos24 dirright) (movedir pos14 pos13 dirup) (movedir pos14 pos15 dirdown) (movedir pos15 pos25 dirright) (movedir pos15 pos14 dirup) (movedir pos21 pos11 dirleft) (movedir pos21 pos31 dirright) (movedir pos21 pos22 dirdown) (movedir pos22 pos12 dirleft) (movedir pos22 pos32 dirright) (movedir pos22 pos21 dirup) (movedir pos22 pos23 dirdown) (movedir pos23 pos13 dirleft) (movedir pos23 pos33 dirright) (movedir pos23 pos22 dirup) (movedir pos23 pos24 dirdown) (movedir pos24 pos14 dirleft) (movedir pos24 pos34 dirright) (movedir pos24 pos23 dirup) (movedir pos24 pos25 dirdown) (movedir pos25 pos15 dirleft) (movedir pos25 pos35 dirright) (movedir pos25 pos24 dirup) (movedir pos31 pos21 dirleft) (movedir pos31 pos41 dirright) (movedir pos31 pos32 dirdown) (movedir pos32 pos22 dirleft) (movedir pos32 pos42 dirright) (movedir pos32 pos31 dirup) (movedir pos32 pos33 dirdown) (movedir pos33 pos23 dirleft) (movedir pos33 pos43 dirright) (movedir pos33 pos32 dirup) (movedir pos33 pos34 dirdown) (movedir pos34 pos24 dirleft) (movedir pos34 pos44 dirright) (movedir pos34 pos33 dirup) (movedir pos34 pos35 dirdown) (movedir pos35 pos25 dirleft) (movedir pos35 pos45 dirright) (movedir pos35 pos34 dirup) (movedir pos41 pos31 dirleft) (movedir pos41 pos51 dirright) (movedir pos41 pos42 dirdown) (movedir pos42 pos32 dirleft) (movedir pos42 pos52 dirright) (movedir pos42 pos41 dirup) (movedir pos42 pos43 dirdown) (movedir pos43 pos33 dirleft) (movedir pos43 pos53 dirright) (movedir pos43 pos42 dirup) (movedir pos43 pos44 dirdown) (movedir pos44 pos34 dirleft) (movedir pos44 pos54 dirright) (movedir pos44 pos43 dirup) (movedir pos44 pos45 dirdown) (movedir pos45 pos35 dirleft) (movedir pos45 pos55 dirright) (movedir pos45 pos44 dirup) (movedir pos51 pos41 dirleft) (movedir pos51 pos52 dirdown) (movedir pos52 pos42 dirleft) (movedir pos52 pos51 dirup) (movedir pos52 pos53 dirdown) (movedir pos53 pos43 dirleft) (movedir pos53 pos52 dirup) (movedir pos53 pos54 dirdown) (movedir pos54 pos44 dirleft) (movedir pos54 pos53 dirup) (movedir pos54 pos55 dirdown) (movedir pos55 pos45 dirleft) (movedir pos55 pos54 dirup) (isnongoal pos11) (isnongoal pos12) (isnongoal pos13) (isnongoal pos14) (isnongoal pos15) (isnongoal pos21) (isnongoal pos22) (isnongoal pos23) (isnongoal pos24) (isnongoal pos25) (isnongoal pos32) (isnongoal pos33) (isnongoal pos34) (isnongoal pos35) (isnongoal pos41) (isnongoal pos42) (isnongoal pos43) (isnongoal pos44) (isnongoal pos45) (isnongoal pos51) (isnongoal pos52) (isnongoal pos53) (isnongoal pos54) (isnongoal pos55) (clear pos14) (clear pos44) (= (total-cost) 0))
 (:goal (and (atgoal stone1)))
 (:metric minimize (total-cost))
)

; plan
1. (move player1 pos14 pos15 dirdown)
   deleted: (at_ player1 pos14) (clear pos15)
   added: (at_ player1 pos15)
   goals met: 0 of 1
2. (move player1 pos15 pos25 dirright)
   deleted: (at_ player1 pos15) (clear pos25)
   added: (at_ player1 pos25) (clear pos15)
   goals met: 0 of 1
3. (move player1 pos25 pos35 dirright)
   deleted: (at_ player1 pos25) (clear pos35)
   added: (at_ player1 pos35) (clear pos25)
   goals met: 0 of 1
4. (move player1 pos35 pos45 dirright)
   deleted: (at_ player1 pos35) (clear pos45)
   added: (at_ player1 pos45) (clear pos35)
   goals met: 0 of 1
5. (pushtonongoal player1 stone1 pos45 pos44 pos43 dirup)
   deleted: (at_ player1 pos45) (at_ stone1 pos44) (clear pos43)
   added: (at_ player1 pos44) (at_ stone1 pos43) (clear pos45)
   goals met: 0 of 1
6. (pushtonongoal player1 stone1 pos44 pos43 pos42 dirup)
   deleted: (at_ player1 pos44) (at_ stone1 pos43) (clear pos42)
   added: (at_ player1 pos43) (at_ stone1 pos42)
   goals met: 0 of 1
7. (pushtonongoal player1 stone1 pos43 pos42 pos41 dirup)
   deleted: (at_ player1 pos43) (at_ stone1 pos42) (clear pos41)
   added: (at_ player1 pos42) (at_ stone1 pos41) (clear pos43)
   goals met: 0 of 1
8. (move player1 pos42 pos52 dirright)
   deleted: (at_ player1 pos42) (clear pos52)
   added: (at_ player1 pos52) (clear pos42)
   goals met: 0 of 1
9. (move player1 pos52 pos51 dirup)
   deleted: (at_ player1 pos52) (clear pos51)
   added: (at_ player1 pos51) (clear pos52)
   goals met: 0 of 1
10. (pushtogoal player1 stone1 pos51 pos41 pos31 dirleft)
   deleted: (at_ player1 pos51) (at_ stone1 pos41) (clear pos31)
   added: (at_ player1 pos41) (at_ stone1 pos31) (clear pos51) (atgoal stone1)
   goals met: 1 of 1
